{
  "version": "v1.0.0",
  "entity": {
    "type": "organisation",
    "role": "owner",
    "name": "The HDF Group",
    "email": "bizoffice@hdfgroup.org",
    "phone": "217-531-6100",
    "description": "The HDF Group is a non-profit organization with the mission of advancing state-of-the-art open-source data management technologies, ensuring long-term access to the data, and supporting our dedicated and diverse user community.",
    "webpageUrl": {
      "url": "https://hdfgroup.org",
      "wellKnown": "https://hdfgroup.org/.well-known/funding-manifest-urls"
    }
  },
  "projects": [
    {
      "guid": "hsds",
      "name": "hsds",
      "description": "HSDS – HDF Scalable Data Service – is a REST-based web service that enables web clients to interact with HDF data sources for both reading and writing.  HSDS can be deployed in the cloud or on-premise and is useful for any situation where multiple clients will be accessing the data via a http endpoint.  This enables HDF to be utilized by web clients (e.g. web apps), as well as programs written in any language that is capable of making HTTP requests.   HSDS supports multiple storage platforms: POSIX, AWS S3, and Azure Blob Storage and can be deployed with Docker, Kubernetes, or as an operating system (e.g. Unix Daemon).

Support for the development of HSDS has been provided by public and commercial organizations who have had a need for specialized features or improved performance for specific use cases.  However one proposal: hsds/docs/design/query/chunk_summary.md at master · HDFGroup/hsds · GitHub, has generated much interest, but as yet, no offer of monetary support.  The idea is to dramatically speed up SQL-like queries over large datasets, without the need to build indexes to the dataset.  While indexing is a popular technique the many databases employ, for the large size common with HDF5 datasets (multi-TB), index creation is both time consuming and uses a significant amount of extra storage.  The chunk summary design avoids these problems and has the potential to be a very useful addition to the HSDS software package.
",
      "webpageUrl": {
        "url": "https://hdfgroup.org",
        "wellKnown": "https://hdfgroup.org/.well-known/funding-manifest-urls"
      },
      "repositoryUrl": {
        "url": "https://github.com/HDFGroup/hsds"
      },
      "licenses": [
        "spdx:Apache-2.0"
      ],
      "tags": [
        "hdf-server",
        "cloud-native",
        "service-based-access",
        "hierarchical-data-format",
        "data-management",
        "data-interoperability",
        "object-storage-backend",
        "heterogeneous-data"
      ]
    }
  ],
  "funding": {
    "channels": [
      {
        "guid": "mybank",
        "type": "bank",
        "address": "Will accept direct bank transfers. Please e-mail me for details.",
        "description": ""
      }
    ],
    "plans": [
      {
        "guid": "developer-compensation",
        "status": "active",
        "name": "HSDS Developer Compensation",
        "description": "This will cover the cost of developers working on the project.",
        "amount": 50000,
        "currency": "USD",
        "frequency": "one-time",
        "channels": [
          "mybank"
        ]
      },
      {
        "guid": "flexible-giving",
        "status": "active",
        "name": "Flexible Giving",
        "description": "Support our project with a goodwill contribution of any size you deem fit.",
        "amount": 0,
        "currency": "USD",
        "frequency": "one-time",
        "channels": [
          "mybank"
        ]
      }
    ],
    "history": []
  }
}
